app/controllers/users_controller.rb

    def index
        # debugger
        # params[:id]???? => answer: nope
        users = User.all
---
SELECT "users".* FROM "users"

    def edit
        @user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def show
        # debugger
        user = User.find_by(id: params[:id])
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 3], ["LIMIT", 1]]

    def create
        user = User.new(user_params)
        if user.save
---
INSERT INTO "users" ("age", "email", "username", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["age", 49], ["email", "greenman@aa.io"], ["username", "hulk"], ["created_at", "2020-12-31 01:27:49.422619"], ["updated_at", "2020-12-31 01:27:49.422619"]]

    def update
        user = User.find_by(id: params[:id])
        if user.update(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
UPDATE "users" SET "age" = $1, "email" = $2, "updated_at" = $3 WHERE "users"."id" = $4  [["age", 49], ["email", "greenman@aa.io"], ["updated_at", "2020-12-31 01:24:26.634962"], ["id", 1]]

    def destroy
        user = User.find_by(id: params[:id])
        if user.destroy
---
SELECT  "users".* FROM "users" WHERE "users"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "users" WHERE "users"."id" = $1  [["id", 1]]